///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//功能：打印以下图形。
//
//*****
// *****
//  *****
//   *****
//    *****
//
//-------------------------------------------------------*/
//#include <stdio.h> 
//int main()
//{
//
//    char a[5][9];
//    int i, j;
//    for (i = 0; i < 5; i++)
//        for (j = 0; j < 9; j++)
//            a[i][j] = ' ';
//    for (i = 0; i < 5; i++)
//        /***********SPACE***********/
//        for (j = i; j < 5+i; j++)
//            a[i][j] = '*';
//    /***********SPACE***********/
//    for (i=0; i < 5; i++)
//    {
//        for (j = 0; j < 9; j++)
//            /***********SPACE***********/
//            printf("%c", a[i][j]);
//        /***********SPACE***********/
//        printf("\n");
//    }
//    return 0;
//}


///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//功能：输入数组，最大的与最后一个元素交换，最小的与第一个元
//      素交换，输出数组。
//
//-------------------------------------------------------*/
//#include  <stdio.h>
//
//input(number)
//int number[10];
//{
//    int i;
//    /***********SPACE***********/
//    for (i = 0; i<=8; i++)
//        scanf("%d,", &number[i]);
//    scanf("%d", &number[9]);
//}
//
//max_min(array)
//int array[10];
//{
//    int* max, * min, k, l;
//    int* p, * arr_end;
//    arr_end = array + 10;
//    max = min = array;
//    for (p = array + 1; p < arr_end; p++)
//        if (*p > *max)
//            max = p;
//        else if (*p < *min)
//            /***********SPACE***********/
//            min = p;
//    k = *max;
//    l = *min;
//    *p = array[0];
//    array[0] = l;
//    /***********SPACE***********/
//    l = array[0];//改正：*min = array[0];
//    *p = array[9];
//    /***********SPACE***********/
//    array[9] = k;
//    k = *p;
//}
//
//output(array)
//int array[10];
//{
//    int* p;
//    for (p = array; p < array + 9; p++)
//        printf("%d,", *p);
//    printf("%d\n", array[9]);
//}
//
//main()
//{
//    int number[10];
//    input(number);
//    max_min(number);
//    output(number);
//}


///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：读入一个整数k(2≤k≤10000)，打印它的所有质因子（即
//	  所有为素数的因子）。
//例如：若输入整数：2310，则应输出：2、3、5、7、11。
//	  请改正程序中的语法错误，使程序能得出正确的结果。
//
//------------------------------------------------------*/
//
//#include "conio.h"
//#include <stdio.h>
//
//IsPrime(int n)//
//{
//	int i, m;
//	m = 1;
//	for (i = 2; i < n; i++)
//		if (n % i == 0)
//		{
//			m = 0;
//			break;
//		}
//	return  m;
//}
//
//int main()
//{
//	int j, k;
//	printf("\nPlease enter an integer number between 2 and 10000: ");
//	scanf("%d", &k);
//	printf("\n\nThe prime factor(s) of %d is( are ):", k);
//	for (j = 2; j <= k; j++)
//		if ((!(k % j)) && (IsPrime(j)))  printf("\n %4d", j);
//	printf("\n");
//	return 0;
//}


///*------------------------------------------------------
//【程序改错】
// --------------------------------------------------------
//
//功能：企业发放的奖金根据利润提成。利润(i)低于或等于10万元
//      时，奖金可提10%；利润高于10万元，低于20万元时，低于
//      10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
//      20万到40万之间时，高于20万元的部分，可提成5%；40万
//      到60万之间时高于40万元的部分，可提成3%；60万到100万
//      之间时，高于60万元的部分，可提成1.5%，高于100万元时，
//      超过100万元的部分按1%提成，从键盘输入当月利润i，求
//      应发放奖金总数？
//
//------------------------------------------------------*/
//
//#include <stdio.h>
//
//int main()
//{
//    long int i;
//    double bonus1, bonus2, bonus4, bonus6, bonus10, bonus;
//    scanf("%ld" , &i);
//    bonus1 = 100000 * 0.1; bonus2 = bonus1 + 100000 * 0.075;
//    bonus4 = bonus2 + 200000 * 0.05;
//    bonus6 = bonus4 + 200000 * 0.03;
//    bonus10 = bonus6 + 400000 * 0.015;//改为0.015
//    if (i <= 100000)//改为 <= 
//        bonus = i * 0.1;
//    else if (i <= 200000)
//        bonus = bonus1 + (i - 100000) * 0.075;
//    else if (i <= 400000)
//        bonus = bonus2 + (i - 200000) * 0.05;
//    else if (i <= 600000)
//        bonus = bonus4 + (i - 400000) * 0.03;
//    else if (i <= 1000000)
//        bonus = bonus6 + (i - 600000) * 0.015;
//    else
//        bonus = bonus10 + (i - 1000000) * 0.01;
//    printf("bonus=%f", bonus);//修改为%f
//        return 0;
//}


///*------------------------------------------------
//【程序设计】
//--------------------------------------------------
//
//功能：求大于lim（lim小于100的整数）并且小于100的所
//      有素数并放在aa数组中，该函数返回所求出素数的
//      个数。
//
//------------------------------------------------*/
//
//#include<stdio.h>
//#include<conio.h>
//#define MAX 100
//void  wwjt();
//
//int fun(int lim, int aa[MAX])
//{
//    /**********Program**********/
//    
//    int i = 0;
//    int j = 0;
//    int k = 0;
//    for (i = lim; i < 100; i++)
//    {
//        int m = 1;
//        for (j = 2; j < i; j++)
//        {
//            if (i % j == 0)
//            {
//                m = 0;
//                break;
//            }
//        }
//        if (m == 1)
//        {
//            aa[k] = i;
//            k++;
//        }
//    }
//    return k;
//
//
//
//
//    /**********  End  **********/
//}
//int main()
//{
//    int limit, i, sum;
//    int aa[MAX];
//    printf("Please input ainteger:");
//    scanf("%d", &limit);
//    sum = fun(limit, aa);
//    for (i = 0; i < sum; i++) {
//        if (i % 10 == 0 && i != 0) printf("\n");
//        printf("%5d", aa[i]);
//    }
//    wwjt();
//    return 0;
//}
//void wwjt()
//{
//    int i, j, array[100], sum, lim;
//    FILE* rf, * wf;
//    rf = fopen("in.dat", "r");
//    wf = fopen("out.dat", "w");
//    for (j = 0; j <= 5; j++)
//    {
//        fscanf(rf, "%d", &lim);
//        sum = fun(lim, array);
//        for (i = 0; i < sum; i++)
//            fprintf(wf, "%7d", array[i]);
//        fprintf(wf, "\n");
//    }
//    fclose(rf);
//    fclose(wf);
//}

///*-------------------------------------------------------
//【程序设计】
//---------------------------------------------------------
//
//题目：一个3×5的整数矩阵，输出其中最大值max、最小值min和它们各自的下标。
//
//-------------------------------------------------------*/
//#include <stdio.h>
////void wwjt();
//
//int min, minl, minh, max, maxl, maxh;
//
//void fun(int a[3][5], int row, int col)
//{
//    int i, j;
//
//    /**********Program**********/
//    min = a[0][0];
//    max = a[0][0];
//    for (i = 0; i < 3; i++)
//    {
//        for (j = 0; j < 5; j++)
//        {
//            if (max < a[i][j])
//            {
//                max = a[i][j];
//                maxh = i;
//                maxl = j;
//            }
//            if (min > a[i][j])
//            {
//                min = a[i][j];
//                minh = i;
//                minl = j;
//            }
//        }
//    }
//
//
//    /**********  End  **********/
//}
//
//int main()
//{
//    int  a[3][5] = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14 };
//    fun(a, 3, 5);
//    printf("最大值=%d，下标：%d行，%d列\n", max, maxl, maxh);
//    printf("最小值=%d，下标：%d行，%d列\n", min, minl, minh);
//   // wwjt();
//    return 0;
//}
//
//

//
//void wwjt()
//{
//
//    FILE* IN, * OUT;
//    int i, j;
//    int a[3][5], row = 3, col = 5;
//    IN = fopen("in.dat", "r");
//    if (IN == NULL)
//    {
//        printf("Please Verify The Currernt Dir..It May Be Changed");
//    }
//    OUT = fopen("out.dat", "w");
//    if (OUT == NULL)
//    {
//        printf("Please Verify The Current Dir.. It May Be Changed");
//    }
//    for (i = 0; i < 3; i++)
//        for (j = 0; j < 5; j++)
//            fscanf(IN, "%d", &a[i][j]);
//    fun(a, row, col);
//    fprintf(OUT, "%d\n", max + minl + maxh);
//    fprintf(OUT, "%d\n", min + maxl + minh);
//    fclose(IN);
//    fclose(OUT);
//}

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//题目： 以下程序按每行5个数的格式输出1至n范围内能被7或17 整除的整数，并求出其和。
//       如输入：50  则输出：
//       7       14      17      21      28
//       34      35      42      49
//       Sum=247
//
//
//-------------------------------------------------------*/
//#include <stdio.h>
//int main()
//{
//    int  i, n, ct = 0, sum = 0;
//    scanf("%d", &n);
//    for (i = 1; i <= n; i++)
//        /***********SPACE***********/
//        if (i % 7 == 0 || i % 17 == 0)
//        {
//            printf("%d\t", i);
//            /***********SPACE***********/
//            sum += i;
//            ct++;
//            /***********SPACE***********/
//            if (ct % 5 == 0)
//                printf("\n");
//        }
//    printf("\nSum=%d\n", sum);
//    return 0;
//}

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//功能：利用指向结构的指针编写求某年、某月、某日是第
//      几天的程序，其中年、月、日和年天数用结构表示。
//
//-------------------------------------------------------*/
//#include <stdio.h>
//#include <stdlib.h>
//main()
//{
//    /***********SPACE***********/
//    struct date
//    {
//       int y,m,d,n;
//    /***********SPACE***********/
//    }x;
//
//    int k, f, a[12] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
//    printf("date:y,m,d=");
//    scanf("%d,%d,%d", &x.y, &x.m, &x.d);
//    f = x.y % 4 == 0 && x.y % 100 != 0 || x.y % 400 == 0;
//    /***********SPACE***********/
//    a[1] += f;//填写f
//    if (x.m < 1 || x.m>12 || x.d<1 || x.d>a[x.m - 1]) exit(0);
//    for (x.n = x.d, k = 0; k < x.m - 1; k++)x.n += a[k];
//    /***********SPACE***********/
//    printf("n=%d\n", x.n);//填写x.n
//}

///*-------------------------------------------------------
//【程序改错】
//---------------------------------------------------------
//
//题目：下列程序从键盘输入一个数n，求1～n之和并输出。请纠正程序中存在错误，使程
//      序实现其功能。
//
//      如输入 5↙
//      输出：The sum from 1 to 5 is 15
//
//-------------------------------------------------------*/
//
//#include <stdio.h>
//int main()
//{
//    int i = 1, n;
//    int sum = 0;
//    scanf("%d", &n);
//    for (; i <= n; i++)
//        sum += i;
//    printf("The sum from 1 to %d is %d\n", n, sum);
//    return 0;
//}

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：输入两个实数，按代数值由小到大输出它们,并在fun()
//      函数中输出。（输出的数据都保留2位小数）
//
//------------------------------------------------------*/
//
//#include <stdio.h>
//
//void fun()
//{
//    float t;
//        float a, b;
//    scanf("%f %f", &a, &b);
//    if (a > b)
//    {
//        t = a;
//        a = b;
//        b = t;
//    }
//    printf("%5.2f ,%5.2f\n", a, b);
//}
//
//int main()
//{
//    fun();
//    return 0;
//}

///*------------------------------------------------
//【程序设计】
//--------------------------------------------------
//
//功能：用函数求fibonacci数列前n项的和。
//说明：fibonacci数列为数列的第一项值为1，第二项值也
//	  为1，从第三项开始，每一项均为其前面相邻两项
//	  的和。
//例如：当n=28时，运行结果：sum=832039
//
//------------------------------------------------*/
//
//#include <stdio.h>
////void  wwjt();
//
//long sum(int n)
//{
//	/**********Program**********/
//	if (n == 1)
//	{
//		return 1;
//	}
//	else
//	{
//		long a = 1;
//		long b = 1;
//		long c = 0;
//		int i = 0;
//		long sum = 2;
//		for (i = 3; i <= n; i++)
//		{
//			c = a + b;
//			sum += c;
//			a = b;
//			b = c;
//		}
//		return sum;
//	}
//
//
//
//
//
//	/**********  End  **********/
//}
//
//int main()
//{
//	int n;
//	scanf("%d", &n);
//	printf("sum=%ld\n", sum(n));
//	//wwjt();
//	return 0;
//}

//void wwjt()
//{
//    FILE* IN, * OUT;
//    int n;
//    int i[2];
//    long int o;
//    IN = fopen("in371.dat", "r");
//    if (IN == NULL)
//    {
//        printf("Read FILE Error");
//    }
//    OUT = fopen("out.dat", "w");
//    if (OUT == NULL)
//    {
//        printf("Write FILE Error");
//    }
//
//    for (n = 0; n < 2; n++)
//    {
//        fscanf(IN, "%d", &i[n]);
//        o = sum(i[n]);
//        fprintf(OUT, "%ld\n", o);
//    }
//
//    fclose(IN);
//    fclose(OUT);
//}

///*------------------------------------------------
//【程序设计】
//--------------------------------------------------
//
//功能：找出一个大于给定整数且紧随这个整数的素数，并
//      作为函数值返回。
//
//------------------------------------------------*/
//
//#include <stdio.h>
////#include"conio.h"
////void  wwjt();
//
//int fun(int n)
//{
//    /**********Program**********/
//    int num = n + 1;
//    int i = 0;
//    while(1)
//    {
//        int flag = 1;
//        for (i = 2; i < num; i++)
//        {
//            if (num % i == 0)
//            {
//                num++;
//                flag = 0;
//                break;
//            }
//        }
//        if (flag == 1)
//        {
//            break;
//        }
//    }
//
//
//
//
//    /**********  End  **********/
//
//}
//
//int main()
//{
//    int  m;
//    printf("Enter m: ");
//    scanf("%d", &m);
//    printf("\nThe result is %d\n", fun(m));
//    //wwjt();
//    return 0;
//}

//void wwjt()
//{
//    FILE* IN, * OUT;
//    int s;
//    int t;
//    int o;
//
//    IN = fopen("in.dat", "r");
//    if (IN == NULL)
//    {
//        printf("Read FILE Error");
//    }
//    OUT = fopen("out.dat", "w");
//    if (OUT == NULL)
//    {
//        printf("Write FILE Error");
//    }
//    for (s = 1; s <= 5; s++)
//    {
//        fscanf(IN, "%d", &t);
//        o = fun(t);
//        fprintf(OUT, "%d\n", o);
//    }
//    fclose(IN);
//    fclose(OUT);
//}

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//功能：找出数组中最大值和此元素的下标，数组元素的值由键盘
//      输入。
//
//-------------------------------------------------------*/
//
//#include <stdio.h>
//void main()
//{
//    int a[10], * p, * s, i;
//    for (i = 0; i < 10; i++)
//        /***********SPACE***********/
//        scanf("%d", &a[i]);
//    /***********SPACE***********/
//    for (p = a, s = a; (p-a) < 10; p++)
//        /***********SPACE***********/
//        if (*p > *s) s = p;
//    /***********SPACE***********/
//    printf("max=%d,index=%d\n", a[s-a], s - a);//直接填写*s
//}

/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下列程序从键盘输入一字符串（可以含有空格），再从键盘输入一个该字符串中的字
      符，删除该字符后重新输出字符串。

-------------------------------------------------------*/
//#include<stdio.h>
//#include<string.h>
//void main()
//{
//    char line[80];
//    char ch;
//    int i, j;
//    int len;
//    printf("输入一行字符 \n");
//    /***********SPACE***********/
//    gets(line, 80);
//    printf("输入要删除字符 ");
//    ch = getchar();
//    i = 0;
//    /***********SPACE***********/
//    while (i <= strlen(line))
//    {
//        while (line[i] != ch && line[i] != '\0')
//            i++;
//        len = strlen(line);
//        for (j = i; j < len - 1; j++)
//            /***********SPACE***********/
//            lin[j]=line[j+1];
//        line[j] = '\0';
//    }
//    puts(line);
//}
//
