/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////功能：打印以下图形。
////
////*****
//// *****
////  *****
////   *****
////    *****
////
////-------------------------------------------------------*/
////#include <stdio.h> 
////int main()
////{
////
////    char a[5][9];
////    int i, j;
////    for (i = 0; i < 5; i++)
////        for (j = 0; j < 9; j++)
////            a[i][j] = ' ';
////    for (i = 0; i < 5; i++)
////        /***********SPACE***********/
////        for (j = i; j<i+5; j++)
////            a[i][j] = '*';
////    /***********SPACE***********/
////    for (i=0; i < 5; i++)
////    {
////        for (j = 0; j < 9; j++)
////            /***********SPACE***********/
////            printf("%c", a[i][j]);
////        /***********SPACE***********/
////        printf("\n");
////    }
////    return 0;
////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////功能：输入数组，最大的与最后一个元素交换，最小的与第一个元
////      素交换，输出数组。
////
////-------------------------------------------------------*/
////#include  <stdio.h>
////
////input(number)
////int number[10];
////{
////    int i;
////    /***********SPACE***********/
////    for (i = 0; i<9; i++)
////        scanf("%d,", &number[i]);
////    scanf("%d", &number[9]);
////}
////
////max_min(array)
////int array[10];
////{
////    int* max, * min, k, l;
////    int* p, * arr_end;
////    arr_end = array + 10;
////    max = min = array;
////    for (p = array + 1; p < arr_end; p++)
////        if (*p > *max)
////            max = p;
////        else if (*p < *min)
////            /***********SPACE***********/
////            min = p;
////    k = *max;
////    l = *min;
////    *p = array[0];
////    array[0] = l;
////    /***********SPACE***********/
////    *p=l;
////    *p = array[9];
////    /***********SPACE***********/
////    array[9]=k;
////    k = *p;
////}
////
////output(array)
////int array[10];
////{
////    int* p;
////    for (p = array; p < array + 9; p++)
////        printf("%d,", *p);
////    printf("%d\n", array[9]);
////}
////
////main()
////{
////    int number[10];
////    input(number);
////    max_min(number);
////    output(number);
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：读入一个整数k(2≤k≤10000)，打印它的所有质因子（即
////      所有为素数的因子）。
////例如：若输入整数：2310，则应输出：2、3、5、7、11。
////      请改正程序中的语法错误，使程序能得出正确的结果。
////
////------------------------------------------------------*/
////
////#include "conio.h"
////#include <stdio.h>
////
////int isPrime(int n)
////{
////    int i, m;
////    m = 1;
////    for (i = 2; i < n; i++)
////        if (n % i==0)
////        {
////            m = 0;
////            break;
////        }
////    
////        return  m;
////    
////}
////
////int main()
////{
////    int j, k;
////    printf("\nPlease enter an integer number between 2 and 10000: ");
////    scanf("%d", &k);
////    printf("\n\nThe prime factor(s) of %d is( are ):", k);
////    for (j = 2; j <= k; j++)
////        if ((!(k % j)) && (isPrime(j)))  printf("\n %4d", j);
////    printf("\n");
////    return 0;
////}
//
/////*------------------------------------------------------
////【程序改错】
//// --------------------------------------------------------
////
////功能：企业发放的奖金根据利润提成。利润(i)低于或等于10万元
////      时，奖金可提10%；利润高于10万元，低于20万元时，低于
////      10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
////      20万到40万之间时，高于20万元的部分，可提成5%；40万
////      到60万之间时高于40万元的部分，可提成3%；60万到100万
////      之间时，高于60万元的部分，可提成1.5%，高于100万元时，
////      超过100万元的部分按1%提成，从键盘输入当月利润i，求
////      应发放奖金总数？
////
////------------------------------------------------------*/
////
////#include <stdio.h>
////
////int main()
////{
////    long int i;
////    double bonus1, bonus2, bonus4, bonus6, bonus10, bonus;
////    scanf("%ld",&i);
////    bonus1 = 100000 * 0.1; bonus2 = bonus1 + 100000 * 0.075;
////    bonus4 = bonus2 + 200000 * 0.05;
////    bonus6 = bonus4 + 200000 * 0.03;
////    bonus10 = bonus6 + 400000 * 0.015;
////    if (i <= 100000)
////        bonus = i * 0.1;
////    else if (i <= 200000)
////        bonus = bonus1 + (i - 100000) * 0.075;
////    else if (i <= 400000)
////        bonus = bonus2 + (i - 200000) * 0.05;
////    else if (i <= 600000)
////        bonus = bonus4 + (i - 400000) * 0.03;
////    else if (i <= 1000000)
////        bonus = bonus6 + (i - 600000) * 0.015;
////    else
////        bonus = bonus10 + (i - 1000000) * 0.01;
////    printf("bonus=%lf", bonus);
////        return 0;
////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////
////功能：求大于lim（lim小于100的整数）并且小于100的所
////      有素数并放在aa数组中，该函数返回所求出素数的
////      个数。
////
////------------------------------------------------*/
////
////#include<stdio.h>
////#include<conio.h>
////#define MAX 100
//////void  wwjt();
////
////int fun(int lim, int aa[MAX])
////{
////    /**********Program**********/
////    int i = 0, j = 0;
////    int k = 0;
////    for (i = lim; i < 100; i++)
////    {
////        int m = 1;
////        for (j = 2; j < i; j++)
////        {
////            if (i % j == 0)
////            {
////                m = 0;
////                break;
////            }
////            
////        }
////        if (m == 1)
////        {
////            aa[k] = i;
////            k++;
////        }
////    }
////    return k;
////
////
////
////
////    /**********  End  **********/
////}
////int main()
////{
////    int limit, i, sum;
////    int aa[MAX];
////    printf("Please input ainteger:");
////    scanf("%d", &limit);
////    sum = fun(limit, aa);
////    for (i = 0; i < sum; i++) {
////        if (i % 10 == 0 && i != 0) printf("\n");
////        printf("%5d", aa[i]);
////    }
////    //wwjt();
////    return 0;
////}
//////void wwjt()
//////{
//////    int i, j, array[100], sum, lim;
//////    FILE* rf, * wf;
//////    rf = fopen("in.dat", "r");
//////    wf = fopen("out.dat", "w");
//////    for (j = 0; j <= 5; j++)
//////    {
//////        fscanf(rf, "%d", &lim);
//////        sum = fun(lim, array);
//////        for (i = 0; i < sum; i++)
//////            fprintf(wf, "%7d", array[i]);
//////        fprintf(wf, "\n");
//////    }
//////    fclose(rf);
//////    fclose(wf);
//////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////
////功能：求大于lim（lim小于100的整数）并且小于100的所
////      有素数并放在aa数组中，该函数返回所求出素数的
////      个数。
////
////------------------------------------------------*/
////
////#include<stdio.h>
////#include<conio.h>
////#define MAX 100
//////void  wwjt();
////
////int fun(int lim, int aa[MAX])
////{
////    /**********Program**********/
////
////
////
////
////
////
////    /**********  End  **********/
////}
////int main()
////{
////    int limit, i, sum;
////    int aa[MAX];
////    printf("Please input ainteger:");
////    scanf("%d", &limit);
////    sum = fun(limit, aa);
////    for (i = 0; i < sum; i++) {
////        if (i % 10 == 0 && i != 0) printf("\n");
////        printf("%5d", aa[i]);
////    }
////    //wwjt();
////    return 0;
////}
//////void wwjt()
//////{
//////    int i, j, array[100], sum, lim;
//////    FILE* rf, * wf;
//////    rf = fopen("in.dat", "r");
//////    wf = fopen("out.dat", "w");
//////    for (j = 0; j <= 5; j++)
//////    {
//////        fscanf(rf, "%d", &lim);
//////        sum = fun(lim, array);
//////        for (i = 0; i < sum; i++)
//////            fprintf(wf, "%7d", array[i]);
//////        fprintf(wf, "\n");
//////    }
//////    fclose(rf);
//////    fclose(wf);
//////}
//
/////*-------------------------------------------------------
////【程序设计】
////---------------------------------------------------------
////
////题目：一个3×5的整数矩阵，输出其中最大值max、最小值min和它们各自的下标。
////
////-------------------------------------------------------*/
////#include <stdio.h>
//////void wwjt();
////
////int min, minl, minh, max, maxl, maxh;
////
////void fun(int a[3][5], int row, int col)
////{
////    int i, j;
////
////    /**********Program**********/
////    min = a[0][0];
////    max = a[0][0];
////    for (i = 0; i < row; i++)
////    {
////        for (j = 0; j < col; j++)
////        {
////            if (min > a[i][j])
////            {
////                min = a[i][j];
////                minl = i;
////                minh = j;
////            }
////            if (max < a[i][j])
////            {
////                max = a[i][j];
////                maxl = i;
////                maxh = j;
////            }
////        }
////    }
////
////
////    /**********  End  **********/
////}
////
////int main()
////{
////    int  a[3][5] = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14 };
////    fun(a, 3, 5);
////    printf("最大值=%d，下标：%d行，%d列\n", max, maxl, maxh);
////    printf("最小值=%d，下标：%d行，%d列\n", min, minl, minh);
////    //wwjt();
////    return 0;
////}
////
////
////
//
////void wwjt()
////{
////
////    FILE* IN, * OUT;
////    int i, j;
////    int a[3][5], row = 3, col = 5;
////    IN = fopen("in.dat", "r");
////    if (IN == NULL)
////    {
////        printf("Please Verify The Currernt Dir..It May Be Changed");
////    }
////    OUT = fopen("out.dat", "w");
////    if (OUT == NULL)
////    {
////        printf("Please Verify The Current Dir.. It May Be Changed");
////    }
////    for (i = 0; i < 3; i++)
////        for (j = 0; j < 5; j++)
////            fscanf(IN, "%d", &a[i][j]);
////    fun(a, row, col);
////    fprintf(OUT, "%d\n", max + minl + maxh);
////    fprintf(OUT, "%d\n", min + maxl + minh);
////    fclose(IN);
////    fclose(OUT);
////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////题目： 以下程序按每行5个数的格式输出1至n范围内能被7或17 整除的整数，并求出其和。
////       如输入：50  则输出：
////       7       14      17      21      28
////       34      35      42      49
////       Sum=247
////
////
////-------------------------------------------------------*/
////#include <stdio.h>
////int main()
////{
////    int  i, n, ct = 0, sum = 0;
////    scanf("%d", &n);
////    for (i = 1; i <= n; i++)
////        /***********SPACE***********/
////        if (i%7==0||i%17==0)
////        {
////            printf("%d\t", i);
////            /***********SPACE***********/
////            sum+=i;
////            ct++;
////            /***********SPACE***********/
////            if (ct%5==0)
////                printf("\n");
////        }
////    printf("\nSum=%d\n", sum);
////    return 0;
////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////功能：利用指向结构的指针编写求某年、某月、某日是第
////      几天的程序，其中年、月、日和年天数用结构表示。
////
////-------------------------------------------------------*/
////#include <stdio.h>
////#include <stdlib.h>
////main()
////{
////    /***********SPACE***********/
////    struct date
////    {
////       int y,m,d,n;
////    /***********SPACE***********/
////    }x;
////
////    int k, f, a[12] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
////    printf("date:y,m,d=");
////    scanf("%d,%d,%d", &x.y, &x.m, &x.d);
////    f = x.y % 4 == 0 && x.y % 100 != 0 || x.y % 400 == 0;
////    /***********SPACE***********/
////    a[1] += f;
////    if (x.m < 1 || x.m>12 || x.d<1 || x.d>a[x.m - 1]) exit(0);
////    for (x.n = x.d, k = 0; k < x.m - 1; k++)x.n += a[k];
////    /***********SPACE***********/
////    printf("n=%d\n", x.n);
////}
//
/////*-------------------------------------------------------
////【程序改错】
////---------------------------------------------------------
////
////题目：下列程序从键盘输入一个数n，求1～n之和并输出。请纠正程序中存在错误，使程
////      序实现其功能。
////
////      如输入 5↙
////      输出：The sum from 1 to 5 is 15
////
////-------------------------------------------------------*/
////
////#include <stdio.h>
////int main()
////{
////    int i = 1, n;
////    int sum = 0;
////    scanf("%d", &n);
////    for (; i <= n; i++)
////        sum += i;
////    printf("The sum from 1 to %d is %d\n", n, sum);
////    return 0;
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：输入两个实数，按代数值由小到大输出它们,并在fun()
////      函数中输出。（输出的数据都保留2位小数）
////
////------------------------------------------------------*/
////
////#include <stdio.h>
////
////void fun()
////{
////    float t;
////        float a, b;
////    scanf("%f %f", &a, &b);
////    if (a > b)
////    {
////        t = a;
////        a = b;
////        b = t;
////    }
////    printf("%5.2f ,%5.2f\n", a, b);
////}
////
////int main()
////{
////    fun();
////    return 0;
////}
//
//	///*------------------------------------------------
//	//【程序设计】
//	//--------------------------------------------------
//	//
//	//功能：用函数求fibonacci数列前n项的和。
//	//说明：fibonacci数列为数列的第一项值为1，第二项值也
//	//      为1，从第三项开始，每一项均为其前面相邻两项
//	//      的和。
//	//例如：当n=28时，运行结果：sum=832039
//	//
//	//------------------------------------------------*/
//	//
//	//#include <stdio.h>
//	////void  wwjt();
//	//
//	//long sum(int n)
//	//{
//	//    /**********Program**********/
//	//    int i = 0;
//	//    int a = 1;
//	//    int b = 1; 
//	//    int sum = a + b;
//	//    int c = 0;
//	//    if (n <= 0)
//	//    {
//	//        return 0;
//	//    }
//	//    else if (n == 1)
//	//    {
//	//        return 1;
//	//    }
//	//    else if (n == 2)
//	//    {
//	//        return 2;
//	//    }
//	//    else
//	//    {
//	//        for (i = 3; i <= n; i++)
//	//        {
//	//            c = a + b;
//	//            sum += c;
//	//            a = b;
//	//            b = c;
//	//        }
//	//    }
//	//    return sum;
//	//    /**********  End  **********/
//	//}
//	//
//	//int main()
//	//{
//	//    int n;
//	//    scanf("%d", &n);
//	//    printf("sum=%ld\n", sum(n));
//	//    //wwjt();
//	//    return 0;
//	//}
//	//
//	////void wwjt()
//	////{
//	////    FILE* IN, * OUT;
//	////    int n;
//	////    int i[2];
//	////    long int o;
//	////    IN = fopen("in371.dat", "r");
//	////    if (IN == NULL)
//	////    {
//	////        printf("Read FILE Error");
//	////    }
//	////    OUT = fopen("out.dat", "w");
//	////    if (OUT == NULL)
//	////    {
//	////        printf("Write FILE Error");
//	////    }
//	////
//	////    for (n = 0; n < 2; n++)
//	////    {
//	////        fscanf(IN, "%d", &i[n]);
//	////        o = sum(i[n]);
//	////        fprintf(OUT, "%ld\n", o);
//	////    }
//	////
//	////    fclose(IN);
//	////    fclose(OUT);
//	////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////
////功能：求大于lim（lim小于100的整数）并且小于100的所
////	  有素数并放在aa数组中，该函数返回所求出素数的
////	  个数。
////
////------------------------------------------------*/
////
////#include<stdio.h>
//////#include<conio.h>
////#define MAX 100
//////void  wwjt();
////
////int fun(int lim, int aa[MAX])
////{
////	/**********Program**********/
////	int i = 0;
////	int j = 0;
////	int k = 0;
////	if (lim < 2)
////		lim = 2;
////	
////	if (lim >= 2)
////	{
////		for (i = lim; i < 100; i++)
////		{
////			int m = 1;
////			for (j = 2; j < i; j++)
////			{
////				if (i % j == 0)
////				{
////					m = 0;
////					break;
////				}
////			}
////			if (m == 1)
////			{
////				aa[k] = i;
////				k++;
////			}
////		}
////	}
////	return k;
////
////
////
////
////	/**********  End  **********/
////}
////int main()
////{
////	int limit, i, sum;
////	int aa[MAX];
////	printf("Please input ainteger:");
////	scanf("%d", &limit);
////	sum = fun(limit, aa);
////	for (i = 0; i < sum; i++) {
////		if (i % 10 == 0 && i != 0) printf("\n");
////		printf("%5d", aa[i]);
////	}
////	//wwjt();
////	return 0;
////}
////void wwjt()
////{
////	int i, j, array[100], sum, lim;
////	FILE* rf, * wf;
////	rf = fopen("in.dat", "r");
////	wf = fopen("out.dat", "w");
////	for (j = 0; j <= 5; j++)
////	{
////		fscanf(rf, "%d", &lim);
////		sum = fun(lim, array);
////		for (i = 0; i < sum; i++)
////			fprintf(wf, "%7d", array[i]);
////		fprintf(wf, "\n");
////	}
////	fclose(rf);
////	fclose(wf);
////}
//
///*------------------------------------------------
//【程序设计】
//--------------------------------------------------
//
//功能：找出一个大于给定整数且紧随这个整数的素数，并
//	  作为函数值返回。
//
//------------------------------------------------*/
//
////#include <stdio.h>
//////#include"conio.h"
//////void  wwjt();
////
////int fun(int n)
////{
////	/**********Program**********/
////	int num = n + 1;
////	int m = 0;
////	do
////	{
////		int i = 0;
////		m = 1;
////		for (i = 2; i < num; i++)
////		{
////			if (num % i == 0)
////			{
////				m = 0;
////				num++;
////				break;
////			}
////		}
////	} while (!m);
////	return num;
////
////
////
////
////	/**********  End  **********/
////
////}
////
////int main()
////{
////	int  m;
////	printf("Enter m: ");
////	scanf("%d", &m);
////	printf("\nThe result is %d\n", fun(m));
////	//wwjt();
////	return 0;
////}
////
//////void wwjt()
//////{
//////	FILE* IN, * OUT;
//////	int s;
//////	int t;
//////	int o;
//////
//////	IN = fopen("in.dat", "r");
//////	if (IN == NULL)
//////	{
//////		printf("Read FILE Error");
//////	}
//////	OUT = fopen("out.dat", "w");
//////	if (OUT == NULL)
//////	{
//////		printf("Write FILE Error");
//////	}
//////	for (s = 1; s <= 5; s++)
//////	{
//////		fscanf(IN, "%d", &t);
//////		o = fun(t);
//////		fprintf(OUT, "%d\n", o);
//////	}
//////	fclose(IN);
//////	fclose(OUT);
//////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////功能：找出数组中最大值和此元素的下标，数组元素的值由键盘
////	  输入。
////
////-------------------------------------------------------*/
////
////#include <stdio.h>
////void main()
////{
////	int a[10], * p, * s, i;
////	for (i = 0; i < 10; i++)
////		/***********SPACE***********/
////		scanf("%d", &a[i]);
////	/***********SPACE***********/
////	for (p = a, s = a; (p - a) < 10; p++)
////		/***********SPACE***********/
////		if (*p > * s) s = p;
////	/***********SPACE***********/
////	printf("max=%d,index=%d\n", *s, s - a);
////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////题目：下列程序从键盘输入一字符串（可以含有空格），再从键盘输入一个该字符串中的字
////	  符，删除该字符后重新输出字符串。
////
////-------------------------------------------------------*/
////#include<stdio.h>
////#include<string.h>
////void main()
////{
////	char line[80];
////	char ch;
////	int i, j;
////	int len;
////	printf("输入一行字符 \n");
////	/***********SPACE***********/
////	fgets(line,80,stdin);
////	printf("输入要删除字符 ");
////	ch = getchar();
////	i = 0;
////	/***********SPACE***********/
////	while (line[i]!='\0')
////	{
////		while (line[i] != ch && line[i] != '\0')
////			i++;
////		len = strlen(line);
////		for (j = i; j < len - 1; j++)
////			/***********SPACE***********/
////			line[j] = line[j+1];
////		line[j] = '\0';
////	}
////	puts(line);
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：编写函数fun求20以内所有5的倍数之积。
////
////------------------------------------------------------*/
////
////#define N 20
////#include <stdio.h>
////
////int fun(int m)
////{
////	int s = 1, i;
////	for (i = 1; i <= N; i++)
////		if (i% m == 0)
////			s *= i;
////	return s;
////}
////
////int main()
////{
////	int sum;
////	sum = fun(5);
////	printf("%d以内所有%d的倍数之积为： %d\n", N, 5, sum);
////	return 0;
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：求一个3行4列矩阵的外框的元素值之和。
////注意：矩阵四个角上的元素不能重复加。
////例如：矩阵元素为1，2，3，4，5，6，7，8，9，10，11，12时，
////	  四框元素值之和应为65。
////
////------------------------------------------------------*/
////#include <stdio.h>
////int fun(int a[3][4], int m, int n)
////{
////	int i, j, s, s1 =0, s2 = 0,s3 = 0,s4 = 0;
////	for (j = 0; j < n; j++)
////	{
////		s1 = s1 + a[0][j];
////		s2 = s2 + a[m - 1][j];
////	}
////	for (i = 0; i < m; i++)
////	{
////		s3 = s3 + a[i][0];
////		s4 = s4 + a[i][n - 1];
////	}
////	s = s1 + s2 + s3 + s4 - a[0][0] - a[0][n - 1] - a[m - 1][0] - a[m - 1][n - 1];
////	return s;
////}
////
////int main()
////{
////	int a[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
////	printf("total=%d\n", fun(a, 3, 4));
////	return 0;
////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////
////功能：将两个两位数的正整数a、b合并形成一个整数放在c
////	  中。合并的方式是： 将a数的十位和个位数依次放
////	  在c数的个位和百位上, b数的十位和个位数依次放
////	  在c数的十位和千位上。
////例如： 当a=45，b=12， 调用该函数后， c=2514。
////
////------------------------------------------------*/
////
////#include <stdio.h>
//////void  wwjt();
////
////void fun(int a, int b, long* c)
////{
////	/**********Program**********/
////	*c = 0;
////	*c += (a % 10) * 100;
////	a /= 10;
////	*c += (a % 10) * 1;
////	*c += (b % 10) * 1000;
////	b /= 10;
////	*c += (b % 10) * 10;
////	
////
////
////
////
////
////	/**********  End  **********/
////}
////
////int main()
////{
////	int a, b;
////	long c;
////	printf("input a, b:");
////	scanf("%d%d", &a, &b);
////	fun(a, b, &c);
////	printf("The result is: %ld\n", c);
////	//wwjt();
////	return 0;
////}
////
//////void wwjt()
//////{
//////	FILE* rf, * wf;
//////	int i, a, b; long c;
//////	rf = fopen("in.dat", "r");
//////	wf = fopen("out.dat", "w");
//////	for (i = 0; i < 10; i++)
//////	{
//////		fscanf(rf, "%d,%d", &a, &b);
//////		fun(a, b, &c);
//////		fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c);
//////	}
//////	fclose(rf);
//////	fclose(wf);
//////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////
////功能：编写一个函数，该函数可以统计一个长度为2的字符
////	  串在另一个字符串中出现的次数。
////例如：假定输入的字符串为：asdasasdfgasdaszx67asdmklo，
////	  字符串为：as,则应输出6。
////
////------------------------------------------------*/
////
////#include<stdio.h>
////#include<string.h>
////#include<conio.h>
//////void  wwjt();
////
////int fun(char* str, char* substr)
////{
////	/**********Program**********/
////	char* p;
////	int i = 0;
////	while ((p = strstr(str, substr)) != NULL)
////	{
////		i++;
////		str = p+1;
////	}
////	return i;
////
////
////
////	/**********  End  **********/
////}
////
////int main()
////{
////	char str[81], substr[3];
////	int n;
////	printf("输入主字符串： ");
////	gets(str);
////	printf("输入子字符串： ");
////	gets(substr);
////	puts(str);
////	puts(substr);
////	n = fun(str, substr);
////	printf("n=%d\n", n);
////	//wwjt();
////	return 0;
////}
////
//////void wwjt()
//////{
//////	FILE* IN, * OUT;
//////	int n;
//////	char i[200];
//////	IN = fopen("in.dat", "r");
//////	if (IN == NULL)
//////	{
//////		printf("Read FILE Error");
//////	}
//////	OUT = fopen("out.dat", "w");
//////	if (OUT == NULL)
//////	{
//////		printf("Write FILE Error");
//////	}
//////	fscanf(IN, "%s", i);
//////	n = fun(i, "as");
//////	fprintf(OUT, "%d", n);
//////	fclose(IN);
//////	fclose(OUT);
//////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////给定程序中，程序的功能是：输入2个字符串，输出2个字符串中
////较短串的长度。请填空。
////
////-------------------------------------------------------*/
////#include <string.h>
////#include <stdio.h>
////
////void main() /*注意：请不要修改或删除程序行*/
////{
////	char a1[20], a2[20];
////	int l1, l2, num;
////	gets(a1);
////	gets(a2);
////	/***********SPACE***********/
////	l1 = strlen(a1);
////	/***********SPACE***********/
////	l2 = strlen(a2);
////	/***********SPACE***********/
////	num = (l1<l2) ? l1 : l2;
////	printf("%d", num);
////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////说明：下面程序的功能是打印出所有的“水仙花数”，请填写
////	  程序所缺内容。
////注：水仙花数是指一个三位数的各位数字的立方和是这个数本身。
////
////-------------------------------------------------------*/
////
////#include"stdio.h"
////void  f(int n)
////{
////	int i, j, k;
////	i = n / 100;
////	/***********SPACE***********/
////	j = (n - i * 100) / 10;
////	k = n % 10;
////	/***********SPACE***********/
////	if (i * i * i + j * j * j + k * k * k == n)
////	{
////		printf("%5d\n", n);
////	}
////}
////
////void main()
////{
////	void f(int n);
////	int i;
////	for (i = 100; i < 1000; i++)
////		f(i);
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：求出两个非零正整数的最大公约数，并作为函数值返回。
////例如：若给num1和num2分别输入49和21，则输出的最大公约数为7。
////
////------------------------------------------------------*/
////#include <stdio.h>
////int fun(int a, int b)
////{
////	int r, t;
////	if (a < b)
////	{
////		t = a;
////		a = b;
////		b = t;
////	}
////	r = a % b;
////	while (r != 0)
////	{
////		a = b;
////		b = r;
////		r = a % b;
////	}
////	return b;
////}
////
////int main()
////{
////	int num1, num2, a;
////	scanf("%d%d", &num1, &num2);
////	a = fun(num1, num2);
////	printf("the maximum common divisor is %d\n\n", a);
////	return 0;
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：求两数平方根之和，作为函数值返回。
////例如：输入12和20，输出结果是：y = 7.936238。
////
////------------------------------------------------------*/
////#include <stdio.h>
////#include <conio.h>
////#include <math.h> 
////
////double fun(double* a, double*b)
////{
////	double c;
////	c = sqrt(*a) + sqrt(*b);
////	return c;
////}
////
////int main()
////{
////	double a, b, y;
////	printf("Enter a & b : ");
////	scanf("%lf%lf", &a, &b);
////	y = fun(&a, &b);
////	printf("y = %lf \n", y);
////	return 0;
////}
//
/////*-------------------------------------------------------
////【程序设计】
////---------------------------------------------------------
////
////题目：从键盘输入实数x，按照如图片所示的公式计算并输出y值：
////
////-------------------------------------------------------*/
////#include <stdio.h>
////#include<math.h>
////int main()
////{
////	double x, y;
////
////	/**********Program**********/
////	scanf("%lf", &x);
////	if (x > 7)
////		y = 2 + sqrt(x);
////	else if (x >= -7 && x <= 7)
////		y = 5 + 3 * x;
////	else
////		y = 3 * x * x;
////
////
////	/**********  End  **********/
////	printf("y=%lf\n", y);
////	return 0;
////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////功能：求n阶方阵主、副对角线上的元素之积。
////------------------------------------------------*/
////
////#define N 4
////#include "stdlib.h"
////#include <stdio.h>
//////void  wwjt();
////
////float mul(int arr[][N])
////{
////	/**********Program**********/
////	
////		float pro = 1.0;
////		int i = 0;
////		for (i = 0; i < N; i++)
////		{
////			pro *= arr[i][i];
////			pro *= arr[i][N - i - 1];
////		}
////		if (N % 2 == 0)
////		{
////			return pro;
////		}
////		else
////		{
////			return (pro - arr[N / 2][N / 2]);
////		}
////	
////
////
////
////
////
////	/**********  End  **********/
////}
////
////int main()
////{
////	srand((unsigned int)time(NULL));
////	int a[N][N], i, j;
////	for (i = 0; i < N; i++)
////		for (j = 0; j < N; j++)
////			a[i][j] = rand() % (10);
////	for (i = 0; i < N; i++)
////	{
////		for (j = 0; j < N; j++)
////			printf("%4d", a[i][j]);
////		printf("\n");
////	}
////	printf("The sum is %f\n", mul(a));
////	//wwjt();
////	return 0;
////}
////
//////void wwjt()
//////{
//////	FILE* IN, * OUT;
//////	int m, n;
//////	int i[4][4];
//////	float o;
//////	IN = fopen("in.dat", "r");
//////	if (IN == NULL)
//////	{
//////		printf("Read FILE Error");
//////	}
//////	OUT = fopen("out.dat", "w");
//////	if (OUT == NULL)
//////	{
//////		printf("Write FILE Error");
//////	}
//////	for (m = 0; m < 100; m++)
//////		for (n = 0; n < 100; n++)
//////		{
//////			fscanf(IN, "%d", &i[m][n]);
//////		}
//////	o = mul(i);
//////	fprintf(OUT, "%f\n", o);
//////	fclose(IN);
//////	fclose(OUT);
//////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////功能：统计一个字符串中的字母、数字、空格和其它字符的个数。
////
////-------------------------------------------------------*/
////
////#include <stdio.h>
////
////void fun(char s[], int b[])
////{
////	int i;
////	for (i = 0; s[i] != '\0'; i++)
////		if ('a' <= s[i] && s[i] <= 'z' || 'A' <= s[i] && s[i] <= 'Z')
////			b[0]++;
////	/***********SPACE***********/
////		else if (s[i]>='0'&&s[i]<='9')
////			b[1]++;
////	/***********SPACE***********/
////		else if (s[i]==' ')
////			b[2]++;
////		else
////			b[3]++;
////}
////
////int main()
////{
////	char s1[80]; int a[4] = { 0 };
////	int k;
////	gets(s1);
////	/***********SPACE***********/
////	fun(s1,a);
////	puts(s1);
////	for (k = 0; k < 4; k++)
////		printf("%4d", a[k]);
////	return 0;
////}
//
/////*-------------------------------------------------------
////【程序填空】
////---------------------------------------------------------
////
////功能：输入两个整数，求他们的按位与。
////
////-------------------------------------------------------*/
////
////#include<stdio.h>
////int main()
////{
////	int x, y, z = 0, a, b, k = 1;
////	scanf("%d,%d", &x, &y);
////	while (x > 0 && y > 0)
////	{
////		a = x % 2;
////		/***********SPACE***********/
////		x = x / 2;
////		b = y % 2;
////		y = y / 2;
////		/***********SPACE***********/
////		z = z + (a * b) * k;
////		k = k * 2;
////	}
////	/***********SPACE***********/
////	printf("z=%d\n", z);
////	return 0;
////}
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：求出两个非零正整数的最大公约数，并作为函数值返回。
////例如：若给num1和num2分别输入49和21，则输出的最大公约数为7。
////
////------------------------------------------------------*/
////#include <stdio.h>
////int fun(int a, int b)
////{
////	int r, t;
////	if (a < b)
////	{
////		t = a;
////		a = b;
////		b = t;
////	}
////	r = a % b;
////	while (r != 0)
////	{
////		a = b;
////		b = r;
////		r = a % b;
////	}
////	return b;
////}
////
////int main()
////{
////	int num1, num2, a;
////	scanf("%d%d", &num1, &num2);
////	a = fun(num1, num2);
////	printf("the maximum common divisor is %d\n\n", a);
////	return 0;
////}
//
/////*------------------------------------------------------
////【程序改错】
////--------------------------------------------------------
////
////功能：编写一个程序，从键盘接收一个字符串，然后按照字符顺
////	  序从小到大进行排序，并删除重复的字符。
////
////------------------------------------------------------*/
////
////#include <stdio.h>
////#include <string.h>
////void main()
////{
////	char str[100], * p, * q, * r, c;
////	printf("输入字符串:");
////	gets(str);
////	for (p = str; *p; p++)
////	{
////		for (q = r = p; *q; q++)
////			if (*r > *q)
////				r = q;
////		if (r != p)
////		{
////			c = *r;
////			*r = *p;
////			*p = c;
////		}
////	}
////	for (p = str; *p; p++)
////	{
////		for (q = p; *p == *q; q++);
////		strcpy(p + 1, q);
////	}
////	printf("结果字符串：%s\n\n", str);
////}
//
/////*-------------------------------------------------------
////【程序设计】
////---------------------------------------------------------
////
////题目：请编写fun函数程序，从键盘输入某一年，判断该年是否为
////	  闰年。
////
////闰年的条件是：（1）能被4整除但不能被100整除。
////			  （2）能被400整除。符合任何一个条件就是闰年。
////				   输入年份为整型
////
////-------------------------------------------------------*/
////#include <stdio.h>
////
//////void wwjt();
////
////int fun(int year)
////{
////
////	/**********Program**********/
////	if ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0))
////	{
////		return 1;
////	}
////	else
////	{
////		return 0;
////	}
////
////	/**********  End  **********/
////}
////
////int main()
////{
////	int year;
////
////	scanf("%d", &year);
////
////	if (fun(year) == 1)
////		printf("yes");
////	else
////		printf("no");
////
////	//wwjt();
////	return 0;
////}
////
//////void wwjt()
//////{
//////
//////	FILE* IN, * OUT;
//////	int j;
//////	int a;
//////	IN = fopen("in.dat", "r");
//////	if (IN == NULL)
//////	{
//////		printf("Please Verify The Currernt Dir..It May Be Changed");
//////	}
//////	OUT = fopen("out.dat", "w");
//////	if (OUT == NULL)
//////	{
//////		printf("Please Verify The Current Dir.. It May Be Changed");
//////	}
//////	for (j = 0; j < 3; j++)
//////	{
//////		fscanf(IN, "%d", &a);
//////		fprintf(OUT, "%d\n", fun(a));
//////
//////	}
//////
//////	fclose(IN);
//////	fclose(OUT);
//////}
//
/////*------------------------------------------------
////【程序设计】
////--------------------------------------------------
////
////功能：将两个两位数的正整数a、b合并形成一个整数放在c
////	  中。合并的方式是： 将a数的十位和个位数依次放
////	  在c数的个位和百位上, b数的十位和个位数依次放
////	  在c数的十位和千位上。
////例如： 当a=45，b=12， 调用该函数后， c=2514。
////
////------------------------------------------------*/
////
////#include <stdio.h>
//////void  wwjt();
////
////void fun(int a, int b, long* c)
////{
////	/**********Program**********/
////	*c = 0;
////	*c += (a % 10) * 100;
////	a /= 10;
////	*c += (a % 10) * 1;
////	*c += (b % 10) * 1000;
////	b /= 10;
////	*c += (b % 10) * 10;
////	/**********  End  **********/
////}
////
////int main()
////{
////	int a, b;
////	long c;
////	printf("input a, b:");
////	scanf("%d%d", &a, &b);
////	fun(a, b, &c);
////	printf("The result is: %ld\n", c);
////	//wwjt();
////	return 0;
////}
////
//////void wwjt()
//////{
//////	FILE* rf, * wf;
//////	int i, a, b; long c;
//////	rf = fopen("in.dat", "r");
//////	wf = fopen("out.dat", "w");
//////	for (i = 0; i < 10; i++)
//////	{
//////		fscanf(rf, "%d,%d", &a, &b);
//////		fun(a, b, &c);
//////		fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c);
//////	}
//////	fclose(rf);
//////	fclose(wf);
//////}
//
//#include<stdio.h>
//#define s(a,b) t=a;a=b;b=t;
//int main()
//{
//	int a = 0;
//	int b = 2;
//	s(a, b);
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}
