/*------------------------------------------------------
【程序改错】
--------------------------------------------------------

功能：编写一个程序，从键盘接收一个字符串，然后按照字符顺
      序从小到大进行排序，并删除重复的字符。

------------------------------------------------------*/

#include <stdio.h>
#include <string.h>
void main()
{
    char str[100], * p, * q, * r, c;
    printf("输入字符串:");
    gets(str);
    for (p = str; p; p++)//改为*p
    {
        for (q = r = p; *q; q++)
            if (*r > *q)
                r = q;
        if (r == p)//改为r!=p
        {
            c = r;//改为c=*r;
            *r = *p;
            *p = c;
        }
    }
    for (p = str; *p; p++)
    {
        for (q = p; *p == *q; q++);
        strcpy(p + 1, q);
    }
    printf("结果字符串：%s\n\n", str);
}
/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

功能：输入两个整数，求他们的按位与。

-------------------------------------------------------*/

#include<stdio.h>
int main()
{
    int x, y, z = 0, a, b, k = 1;
    scanf("%d,%d", &x, &y);
    while (x > 0 && y > 0)
    {
        a = x % 2;
        /***********SPACE***********/
        x = 【 ? 】;//填写x/2
        b = y % 2;
        y = y / 2;
        /***********SPACE***********/
        z = z + 【 ? 】//填写(a * b)* k;
            k = k * 2;
    }
    /***********SPACE***********/
    【 ? 】("z=%d\n", z);//填写printf
    return 0;
}
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写一个函数，该函数可以统计一个长度为2的字符
      串在另一个字符串中出现的次数。
例如：假定输入的字符串为：asdasasdfgasdaszx67asdmklo，
      字符串为：as,则应输出6。

------------------------------------------------*/

#include<stdio.h>
#include<string.h>
#include<conio.h>

int fun(char* str, char* substr)
{
    /**********Program**********/
    char* p;
    int count = 0;
    while ((p = strstr(str, substr)) != NULL)
    {
        count++;
        str = p + 1;
    }
    return count;




    /**********  End  **********/
}

int main()
{
    char str[81], substr[3];
    int n;
    printf("输入主字符串： ");
    gets(str);
    printf("输入子字符串： ");
    gets(substr);
    puts(str);
    puts(substr);
    n = fun(str, substr);
    printf("n=%d\n", n);
    return 0;
}
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：用函数求fibonacci数列前n项的和。
说明：fibonacci数列为数列的第一项值为1，第二项值也
      为1，从第三项开始，每一项均为其前面相邻两项
      的和。
例如：当n=28时，运行结果：sum=832039

------------------------------------------------*/

#include <stdio.h>


long sum(int n)
{
    /**********Program**********/
    int i = 0;
    long a = 1;
    long b = 1;
    long c = 0;
    long sum = 2;
    if (n == 1)
    {
        return 1;
    }
    else if (n < 1)
    {
        return 0;
    }
    else if (n == 2)
    {
        return 2;
    }
    else
    {
        for (i = 3; i <= n; i++)
        {
            c = a + b;
            sum += c;
            a = b;
            b = c;
        }
    }
    return sum;




    /**********  End  **********/
}

int main()
{
    int n;
    scanf("%d", &n);
    printf("sum=%ld\n", sum(n));
    return 0;
}
/*------------------------------------------------------
【程序改错】
 --------------------------------------------------------

功能：企业发放的奖金根据利润提成。利润(i)低于或等于10万元
      时，奖金可提10%；利润高于10万元，低于20万元时，低于
      10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
      20万到40万之间时，高于20万元的部分，可提成5%；40万
      到60万之间时高于40万元的部分，可提成3%；60万到100万
      之间时，高于60万元的部分，可提成1.5%，高于100万元时，
      超过100万元的部分按1%提成，从键盘输入当月利润i，求
      应发放奖金总数？

------------------------------------------------------*/

#include <stdio.h>

int main()
{
    long int i;
    double bonus1, bonus2, bonus4, bonus6, bonus10, bonus;
    scanf("%ld" & i);//改为scanf("%ld",&i);
    bonus1 = 100000 * 0.1; bonus2 = bonus1 + 100000 * 0.075;
    bonus4 = bonus2 + 200000 * 0.05;
    bonus6 = bonus4 + 200000 * 0.03;
    bonus10 = bonus6 + 400000 * 0.15;//改为0.015
    if (i > 100000)//改为i<=100000
        bonus = i * 0.1;
    else if (i <= 200000)
        bonus = bonus1 + (i - 100000) * 0.075;
    else if (i <= 400000)
        bonus = bonus2 + (i - 200000) * 0.05;
    else if (i <= 600000)
        bonus = bonus4 + (i - 400000) * 0.03;
    else if (i <= 1000000)
        bonus = bonus6 + (i - 600000) * 0.015;
    else
        bonus = bonus10 + (i - 1000000) * 0.01;
    printf("bonus=%d", bonus)//改为printf("bonus=%lf",bonus);
        return 0;
}
