///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//题目：下列程序从键盘输入一字符串（可以含有空格），再从键盘输入一个该字符串中的字
//      符，删除该字符后重新输出字符串。
//
//-------------------------------------------------------*/
//#include<stdio.h>
//#include<string.h>
//void main()
//{
//    char line[80];
//    char ch;
//    int i, j;
//    int len;
//    printf("输入一行字符 \n");
//    /***********SPACE***********/
//    //gets(line,80);
//    fgets(line, sizeof(line), stdin);
//    printf("输入要删除字符 ");
//    ch = getchar();
//    i = 0;
//    /***********SPACE***********/
//    while (i<strlen(line))
//    {
//        while (line[i] != ch && line[i] != '\0')
//            i++;
//        len = strlen(line);
//        for (j = i; j < len - 1; j++)
//            /***********SPACE***********/
//            line[j]=line[j+1];
//        line[j] = '\0';
//    }
//    puts(line);
//}

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：编写函数fun求20以内所有5的倍数之积。
//
//------------------------------------------------------*/
//
//#define N 20
//#include <stdio.h>
//
//int fun(int m)
//{
//    int s = 1, i;
//    for (i = 1; i < N; i++)
//        if (i% m == 0)
//            s *= i;
//    return s;
//}
//
//int main()
//{
//    int sum;
//    sum = fun(5);
//    printf("%d以内所有%d的倍数之积为： %d\n", N, 5, sum);
//    return 0;
//}
//

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：求一个3行4列矩阵的外框的元素值之和。
//注意：矩阵四个角上的元素不能重复加。
//例如：矩阵元素为1，2，3，4，5，6，7，8，9，10，11，12时，
//      四框元素值之和应为65。
//
//------------------------------------------------------*/
//#include <stdio.h>
//int fun(int a[3][4], int m, int n)
//{
//    int i, j, s, s1 = 0, s2 = 0, s3 = 0, s4 = 0;
//    for (j = 0; j < n; j++)
//    {
//        s1 = s1 + a[0][j];
//        s2 = s2 + a[m - 1][j];
//    }
//    for (i = 0; i < m; i++)
//    {
//        s3 = s3 + a[i][0];
//        s4 = s4 + a[i][n - 1];
//    }
//    s = s1 + s2 + s3 + s4 - a[0][0] - a[0][n - 1] - a[m - 1][0] - a[m - 1][n - 1];
//    return s;
//}
//
//int main()
//{
//    int a[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//    printf("total=%d\n", fun(a, 3, 4));
//    return 0;
//}

///*------------------------------------------------
//【程序设计】
//--------------------------------------------------
//
//功能：将两个两位数的正整数a、b合并形成一个整数放在c
//      中。合并的方式是： 将a数的十位和个位数依次放
//      在c数的个位和百位上, b数的十位和个位数依次放
//      在c数的十位和千位上。
//例如： 当a=45，b=12， 调用该函数后， c=2514。
//
//------------------------------------------------*/
//
//#include <stdio.h>
////void  wwjt();
//
//void fun(int a, int b, long* c)
//{
//    /**********Program**********/
//    *c = 0;
//    *c += (a % 10) * 100;
//    a /= 10;
//    *c += (a % 10) * 1;
//    *c += (b % 10) * 1000;
//    b /= 10;
//    *c += (b % 10) * 10;
//
//    /**********  End  **********/
//}
//
//int main()
//{
//    int a, b;
//    long c;
//    printf("input a, b:");
//    scanf("%d%d", &a, &b);
//    fun(a, b, &c);
//    printf("The result is: %ld\n", c);
//    //wwjt();
//    return 0;
//}

//void wwjt()
//{
//    FILE* rf, * wf;
//    int i, a, b; long c;
//    rf = fopen("in.dat", "r");
//    wf = fopen("out.dat", "w");
//    for (i = 0; i < 10; i++)
//    {
//        fscanf(rf, "%d,%d", &a, &b);
//        fun(a, b, &c);
//        fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c);
//    }
//    fclose(rf);
//    fclose(wf);
//}
//

///*------------------------------------------------
//【程序设计】
//--------------------------------------------------
//
//功能：编写一个函数，该函数可以统计一个长度为2的字符
//      串在另一个字符串中出现的次数。
//例如：假定输入的字符串为：asdasasdfgasdaszx67asdmklo，
//      字符串为：as,则应输出6。
//
//------------------------------------------------*/
//
//#include<stdio.h>
//#include<string.h>
//#include<conio.h>
////void  wwjt();
//
//int fun(char* str, char* substr)
//{
//    /**********Program**********/
//    char* p = str;
//    int count = 0;
//    while ((p=strstr(p, substr)) != NULL)
//    {
//        count++;
//        p++;
//    }
//
//    return count;
//
//
//
//    /**********  End  **********/
//}
//
//int main()
//{
//    char str[81], substr[3];
//    int n;
//    printf("输入主字符串： ");
//    gets(str);
//    printf("输入子字符串： ");
//    gets(substr);
//    puts(str);
//    puts(substr);
//    n = fun(str, substr);
//    printf("n=%d\n", n);
//   // wwjt();
//    return 0;
//}

//void wwjt()
//{
//    FILE* IN, * OUT;
//    int n;
//    char i[200];
//    IN = fopen("in.dat", "r");
//    if (IN == NULL)
//    {
//        printf("Read FILE Error");
//    }
//    OUT = fopen("out.dat", "w");
//    if (OUT == NULL)
//    {
//        printf("Write FILE Error");
//    }
//    fscanf(IN, "%s", i);
//    n = fun(i, "as");
//    fprintf(OUT, "%d", n);
//    fclose(IN);
//    fclose(OUT);
//}

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//给定程序中，程序的功能是：输入2个字符串，输出2个字符串中
//较短串的长度。请填空。
//
//-------------------------------------------------------*/
//#include <string.h>
//#include <stdio.h>
//
//void main() /*注意：请不要修改或删除程序行*/
//{
//	char a1[20], a2[20];
//	int l1, l2, num;
//	gets(a1);
//	gets(a2);
//	/***********SPACE***********/
//	l1 = strlen(a1);
//	/***********SPACE***********/
//	l2 = strlen(a2);
//	/***********SPACE***********/
//	num = (l1<l2) ? l1 : l2;
//	printf("%d", num);
//}
//

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//说明：下面程序的功能是打印出所有的“水仙花数”，请填写
//      程序所缺内容。
//注：水仙花数是指一个三位数的各位数字的立方和是这个数本身。
//
//-------------------------------------------------------*/
//
//#include"stdio.h"
//void  f(int n)
//{
//    int i, j, k;
//    i = n / 100;
//    /***********SPACE***********/
//    j = (n - i * 100) / 10;
//    k = n % 10;
//    /***********SPACE***********/
//    if (i * i * i + j * j * j + k * k * k == n)
//    {
//        printf("%5d\n", n);
//    }
//}
//
//void main()
//{
//    void f(int n);
//    int i;
//    for (i = 100; i < 1000; i++)
//        f(i);
//}

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：求出两个非零正整数的最大公约数，并作为函数值返回。
//例如：若给num1和num2分别输入49和21，则输出的最大公约数为7。
//
//------------------------------------------------------*/
//#include <stdio.h>
//int fun(int a, int b)
//{
//    int r, t;
//    if (a < b)
//    {
//        t = a;
//        a = b;
//        b = t;//交换的代码步正确
//    }
//    r = a % b;
//    while (r != 0)
//    {
//        a = b;
//        b = r;
//        r = a % b;
//    }
//    return b;
//}
//
//int main()
//{
//    int num1, num2, a;
//    scanf("%d%d", &num1, &num2);
//    a = fun(num1, num2);
//    printf("the maximum common divisor is %d\n\n", a);
//    return 0;
//}

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：求两数平方根之和，作为函数值返回。
//例如：输入12和20，输出结果是：y = 7.936238。
//
//------------------------------------------------------*/
//#include <stdio.h>
//#include <conio.h>
//#include <math.h> 
//
//double fun(double* a, double*b)
//{
//	double c = 0;
//	c = sqrt(*a) + sqrt(*b);
//	return c;
//}
//
//int main()
//{
//	double a, b, y;
//	printf("Enter a & b : ");
//	scanf("%lf%lf", &a, &b);
//	y = fun(&a, &b);
//	printf("y = %f \n", y);
//	return 0;
//}

///*-------------------------------------------------------
//【程序设计】
//---------------------------------------------------------
//
//题目：从键盘输入实数x，按照如图片所示的公式计算并输出y值：
//
//-------------------------------------------------------*/
//#include <stdio.h>
//#include<math.h>
//int main()
//{
//	double x, y;
//
//	/**********Program**********/
//	scanf("%lf", &x);
//	if (x > 7)
//		y = 2 + sqrt(x);
//	else if (x >= -7 && x <= 7)
//		y = 5 + 3 * x;
//	else
//		y = 3 * x * x;
//
//
//	/**********  End  **********/
//	printf("y=%lf\n", y);
//	return 0;
//}

/*------------------------------------------------
【程序设计】
--------------------------------------------------
功能：求n阶方阵主、副对角线上的元素之积。
------------------------------------------------*/

//#define N 4
//#include "stdlib.h"
//#include <stdio.h>
////void  wwjt();
//
//float mul(int arr[][N])
//{
//    /**********Program**********/
//    /*float pro = 1;
//    if (N % 2 == 0)
//    {
//        int i = 0;
//        for (i = 0; i < N; i++)
//        {
//            pro *= (arr[i][i] * arr[i][N - 1 - i]);
//        }
//    }
//    else
//    {
//        int i = 0;
//        for (i = 0; i < N; i++)
//        {
//            pro *= (arr[i][i] * arr[i][N - 1 - i]);
//        }
//        pro /= arr[N / 2][N / 2];
//    }*/
//    float pro = 1;
//    int i = 0;
//    for (i = 0; i < N; i++)
//    {
//        pro *= (arr[i][i] * arr[i][N - 1 - i]);
//    }
//    if (N % 2 != 0)
//    {
//        pro /= arr[N / 2][N / 2];
//    }
//
//    return pro;
//
//
//
//    /**********  End  **********/
//}
//
//int main()
//{
//    srand((unsigned int)time(NULL));
//    int a[N][N], i, j;
//    for (i = 0; i < N; i++)
//        for (j = 0; j < N; j++)
//            a[i][j] = rand() % (10);
//    for (i = 0; i < N; i++)
//    {
//        for (j = 0; j < N; j++)
//            printf("%4d", a[i][j]);
//        printf("\n");
//    }
//    printf("The sum is %f\n", mul(a));
//   // wwjt();
//    return 0;
//}

//void wwjt()
//{
//    FILE* IN, * OUT;
//    int m, n;
//    int i[4][4];
//    float o;
//    IN = fopen("in.dat", "r");
//    if (IN == NULL)
//    {
//        printf("Read FILE Error");
//    }
//    OUT = fopen("out.dat", "w");
//    if (OUT == NULL)
//    {
//        printf("Write FILE Error");
//    }
//    for (m = 0; m < 100; m++)
//        for (n = 0; n < 100; n++)
//        {
//            fscanf(IN, "%d", &i[m][n]);
//        }
//    o = mul(i);
//    fprintf(OUT, "%f\n", o);
//    fclose(IN);
//    fclose(OUT);
//}

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//功能：统计一个字符串中的字母、数字、空格和其它字符的个数。
//
//-------------------------------------------------------*/
//
//#include <stdio.h>
//
//void fun(char s[], int b[])
//{
//    int i;
//    for (i = 0; s[i] != '\0'; i++)
//        if ('a' <= s[i] && s[i] <= 'z' || 'A' <= s[i] && s[i] <= 'Z')
//            b[0]++;
//    /***********SPACE***********/
//        else if (s[i]>='0'&&s[i]<='9')//从零到九
//            b[1]++;
//    /***********SPACE***********/
//        else if (s[i]==' ')
//            b[2]++;
//        else
//            b[3]++;
//}
//
//int main()
//{
//    char s1[80]; int a[4] = { 0 };
//    int k;
//    gets(s1);
//    /***********SPACE***********/
//    fun(s1, a);
//    puts(s1);
//    for (k = 0; k < 4; k++)
//        printf("%4d", a[k]);
//    return 0;
//}

///*-------------------------------------------------------
//【程序填空】
//---------------------------------------------------------
//
//功能：输入两个整数，求他们的按位与。
//
//-------------------------------------------------------*/
//
//#include<stdio.h>
//int main()
//{
//    int x, y, z = 0, a, b, k = 1;
//    scanf("%d,%d", &x, &y);
//    while (x > 0 && y > 0)
//    {
//        a = x % 2;
//        /***********SPACE***********/
//        x = x / 2;
//        b = y % 2;
//        y = y / 2;
//        /***********SPACE***********/
//        z = z + (a*b);
//        k = k * 2;
//    }
//    /***********SPACE***********/
//    printf("z=%d\n", z);
//    return 0;
//}

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：求出两个非零正整数的最大公约数，并作为函数值返回。
//例如：若给num1和num2分别输入49和21，则输出的最大公约数为7。
//
//------------------------------------------------------*/
//#include <stdio.h>
//int fun(int a, int b)
//{
//    int r, t;
//    if (a < b)
//    {
//        t = a;
//        a = b;
//        b = t;
//    }
//    r = a % b;
//    while (r != 0)
//    {
//        a = b;
//        b = r;
//        r = a % b;
//    }
//    return b;
//}
//
//int main()
//{
//    int num1, num2, a;
//    scanf("%d%d", &num1, &num2);
//    a = fun(num1, num2);
//    printf("the maximum common divisor is %d\n\n", a);
//    return 0;
//}

///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：编写一个程序，从键盘接收一个字符串，然后按照字符顺
//      序从小到大进行排序，并删除重复的字符。
//
//------------------------------------------------------*/
//
//#include <stdio.h>
//#include <string.h>
//void main()
//{
//    char str[100], * p, * q, * r, c;
//    printf("输入字符串:");
//    gets(str);
//    for (p = str; *p; p++)
//    {
//        for (q = r = p; *q; q++)
//            if (*r > *q)
//                r = q;
//        if (r != p)
//        {
//            c = *r;
//            *r = *p;
//            *p = c;
//        }
//    }
//    for (p = str; *p; p++)
//    {
//        for (q = p; *p == *q; q++);
//        strcpy(p + 1, q);
//    }
//    printf("结果字符串：%s\n\n", str);
//}


///*------------------------------------------------------
//【程序改错】
//--------------------------------------------------------
//
//功能：编写一个程序，从键盘接收一个字符串，然后按照字符顺
//      序从小到大进行排序，并删除重复的字符。
//
//------------------------------------------------------*/
//
//#include <stdio.h>
//#include <string.h>
//void main()
//{
//    char str[100], * p, * q, * r, c;
//    printf("输入字符串:");
//    gets(str);
//    for (p = str; *p; p++)
//    {
//        for (q = r = p; *q; q++)
//            if (*r > *q)
//                r = q;
//        if (r != p)
//        {
//            c = *r;
//            *r = *p;
//            *p = c;
//        }
//    }
//    for (p = str; *p; p++)
//    {
//        for (q = p; *p == *q; q++);
//        strcpy(p + 1, q);
//    }
//    printf("结果字符串：%s\n\n", str);
//}

///*-------------------------------------------------------
//【程序设计】
//---------------------------------------------------------
//
//题目：请编写fun函数程序，从键盘输入某一年，判断该年是否为
//      闰年。
//
//闰年的条件是：（1）能被4整除但不能被100整除。
//              （2）能被400整除。符合任何一个条件就是闰年。
//                   输入年份为整型
//
//-------------------------------------------------------*/
//#include <stdio.h>
//
////void wwjt();
//
//int fun(int year)
//{
//
//    /**********Program**********/
//    if ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0))
//    {
//        return 1;
//    }
//    else
//    {
//        return 0;
//    }
//    /**********  End  **********/
//}
//
//int main()
//{
//    int year;
//
//    scanf("%d", &year);
//
//    if (fun(year) == 1)
//        printf("yes");
//    else
//        printf("no");
//
//    //wwjt();
//    return 0;
//}

//void wwjt()
//{
//
//    FILE* IN, * OUT;
//    int j;
//    int a;
//    IN = fopen("in.dat", "r");
//    if (IN == NULL)
//    {
//        printf("Please Verify The Currernt Dir..It May Be Changed");
//    }
//    OUT = fopen("out.dat", "w");
//    if (OUT == NULL)
//    {
//        printf("Please Verify The Current Dir.. It May Be Changed");
//    }
//    for (j = 0; j < 3; j++)
//    {
//        fscanf(IN, "%d", &a);
//        fprintf(OUT, "%d\n", fun(a));
//
//    }
//
//    fclose(IN);
//    fclose(OUT);
//}

/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将两个两位数的正整数a、b合并形成一个整数放在c
      中。合并的方式是： 将a数的十位和个位数依次放
      在c数的个位和百位上, b数的十位和个位数依次放
      在c数的十位和千位上。
例如： 当a=45，b=12， 调用该函数后， c=2514。

------------------------------------------------*/

#include <stdio.h>
//void  wwjt();

void fun(int a, int b, long* c)
{
    /**********Program**********/






    /**********  End  **********/
}

int main()
{
    int a, b;
    long c;
    printf("input a, b:");
    scanf("%d%d", &a, &b);
    fun(a, b, &c);
    printf("The result is: %ld\n", c);
    //wwjt();
    return 0;
}
//
//void wwjt()
//{
//    FILE* rf, * wf;
//    int i, a, b; long c;
//    rf = fopen("in.dat", "r");
//    wf = fopen("out.dat", "w");
//    for (i = 0; i < 10; i++)
//    {
//        fscanf(rf, "%d,%d", &a, &b);
//        fun(a, b, &c);
//        fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c);
//    }
//    fclose(rf);
//    fclose(wf);
//}
