////内存 --> 内存的单元（1byte）--> 编号 --> 地址 --> 指针
////所以指针就是一个地址而已
////口头表达的指针一般指：指针变量
////指针变量就是一个变量而已，就是一块内存空间，指针变量用来存放地址
////#include<stdio.h>
////指针数组：本质上就是数组，数组中存放的是指针（地址）
////int* pa;
////int* pb;
////int* pc;
////int* arr[3] = {pa, pb, pc};
//
////数组名：
////1.数组名在大部分呢情况下表示：数组首元素的地址
////但是有两个例外，下面两个数组名表示整个数组
////a）sizeof（数组名）
////b）&数组名
//
////2.&数组名 取出的是数组的地址
//
////int arr[10] = {1,2,3};
////parr = &arr;
////数组指针
////int a = 0;
////pa是整形指针
////int* pa = &a;
////char ch = 'w';
////char* pc = &ch;
////pc是字符指针
////char* pc = &ch;
////int(*parr)[10] = &arr;
////指向数组的指针就是数组指针
////函数指针
////行数也是有地址的
////存放函数指针的数组
////int(*pfArr[10])(int,int)
////函数指针
////pfArr数组的每一个元素的类型：int(*)(int,int)
////回调函数
////通过函数指针调用的函数就是回调函数
////qsort - 使用冒泡排序的思想，模拟实现了一下sqrt
////1.qsort怎么使用
////2.知道qsort怎么使用回调函数实现通用使用
////int Add(int x, int y)
////{
////	return x + y;
////}
////
////int main()
////{
////	/*int a = 10;
////	int* pa = &a;
////	*pa = 20;
////	printf("%d\n", a);
////
////	char ch = 'w';
////	char* pc = &ch;*/
////
////	int (*pf)(int, int) = &Add;
////	//函数的地址存放在函数指针变量中
////
////	int sum = (*pf)(2, 3);
////	int ret = pf(2, 3);
////	printf("%d \n", sum);
////	printf("%d\n", ret);
////	return 0;
////}
////1.指针+1/-1的操作，跳过几个字节（步长）
////2.解引用操作的时候的权限
//
////1.+- 整数
////数据结构
////指针+结构体+动态内存管理
//
////
////#include<stdio.h>
//////数组名的地址
//////指针的运算和指针类型的定义
////int main()
////{
////	int a[] = { 1,2,3,4 };
////	printf("%d\n", sizeof(a));//16 true
////	//sizeof(数组名)，数组名表示整个数组，计算的是整个数组的大小，单位字节
////	printf("%d\n", sizeof(a + 0));//x86:4/x64:8
////	//a不是单独的放在sizeof内部，也没有取地址，所以a就是首元素的地址，a+0还是首元素地址
////	//是地址，大小就是4/8个字节
////	printf("%d\n", sizeof(*a));//4
////	//*a中的a是数组首元素的地址，*a就是对首元素的地址解引用，找到的就是首元素
////	printf("%d\n", sizeof(a + 1));//4
////	//这里的a是数组首元素的地址
////	//a+1是第二个元素的地址
////	//sizeof(a+1)就是地址的大小
////	printf("%d\n", sizeof(a[1]));//4
////	//计算的是第二个元素的大小
////	printf("%d\n", sizeof(&a));//16 false 4/8 true
////	//&a取出的数组的地址，数组的地址，也就是个地址
////	printf("%d\n", sizeof(*&a));//4 falsse 16 true
////	//&a ---> int(*)[4]
////	//&a拿到的是数组名的地址，类型是 int(*)[4],是一种数组指针
////	//*&a --> a
////	//
////	//2.
////	//&和*抵消了
////	//*&a ---> a
////	printf("%d\n", sizeof(&a + 1));//4/8
////	//&a+1 跳过的是一整个数组的大小，得到的还是一个指针，所以是四个或者八个字节
////	//&a+1是从数组a的地址向后跳过了（一个四个整型元素的）数组的大小
////	printf("%d\n", sizeof(&a[0]));//4/8
////	//&a[0]就是计算第一个元素的地址
////	//计算的是地址的大小
////	printf("%d\n", sizeof(&a[0] + 1));//4/8
////	//&a[0]+1是第二个元素的地址
////	//大小是4/8个字节
////	//&a[0]+1 --> &a[1]
////
////	return 0;
////}