/*------------------------------------------------------
【程序改错】
--------------------------------------------------------

功能：求一个3行4列矩阵的外框的元素值之和。
注意：矩阵四个角上的元素不能重复加。
例如：矩阵元素为1，2，3，4，5，6，7，8，9，10，11，12时，
      四框元素值之和应为65。

------------------------------------------------------*/
#include <stdio.h>
int fun(int a[3][4], int m, int n)
{
    int i, j, s, s1 = s2 = s3 = s4 = 0;
    for (j = 0; j < n; j++)
    {
        s1 = s1 + a[0][j];
        s2 = s2 + a[m][j];
    }
    for (i = 0; i < m; i++)
    {
        s3 = s3 + a[i][0];
        s4 = s4 + a[i][n - 1];
    }
    s = s1 - s2 - s3 - s4;
    return s;
}

int main()
{
    int a[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
    printf("total=%d\n", fun(a, 3, 4));
    return 0;
}