/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下列程序从键盘输入一字符串（可以含有空格），再从键盘输入一个该字符串中的字
      符，删除该字符后重新输出字符串。

-------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
void main()
{
    char line[80];
    char ch;
    int i, j;
    int len;
    printf("输入一行字符 \n");
    /***********SPACE***********/
    【 ? 】;
    printf("输入要删除字符 ");
    ch = getchar();
    i = 0;
    /***********SPACE***********/
    while (【 ? 】)
    {
        while (line[i] != ch && line[i] != '\0')
            i++;
        len = strlen(line);
        for (j = i; j < len - 1; j++)
            /***********SPACE***********/
            【 ? 】;
        line[j] = '\0';
    }
    puts(line);
}