/*------------------------------------------------------
【程序改错】
--------------------------------------------------------

功能：编写一个程序，从键盘接收一个字符串，然后按照字符顺
      序从小到大进行排序，并删除重复的字符。

------------------------------------------------------*/

#include <stdio.h>
#include <string.h>
void main()
{
    char str[100], * p, * q, * r, c;
    printf("输入字符串:");
    gets(str);
    for (p = str; p; p++)
    {
        for (q = r = p; *q; q++)
            if (*r > *q)
                r = q;
        if (r == p)
        {
            c = r;
            *r = *p;
            *p = c;
        }
    }
    for (p = str; *p; p++)
    {
        for (q = p; *p == *q; q++);
        strcpy(p + 1, q);
    }
    printf("结果字符串：%s\n\n", str);
}